app/controllers/url_shorteners_controller.rb

  def index
    @url_shorteners = UrlShortener.all
---
SELECT "url_shorteners".* FROM "url_shorteners"

  def create
    @url_shortener = UrlShortener.new(url_shortener_params)

    respond_to do |format|
      if @url_shortener.save
---
INSERT INTO "url_shorteners" ("url", "shortened_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["url", "https://www.google.com/"], ["shortened_url", "04cbcf"], ["created_at", "2021-09-22 15:55:53.681593"], ["updated_at", "2021-09-22 15:55:53.681593"]]

  def destroy
    @url_shortener.destroy
---
DELETE FROM "url_shorteners" WHERE "url_shorteners"."id" = ?  [["id", 9]]

  def redirect
    return redirect_to url_shorteners_path if @url_shortener.nil? && signed_in?

    if @url_shortener.active?
      @url_shortener.update_column(:clicked, @url_shortener.clicked + 1)
---
UPDATE "url_shorteners" SET "clicked" = $1 WHERE "url_shorteners"."id" = $2  [["clicked", 2], ["id", 5]]

  def set_url_shortener
    @url_shortener = UrlShortener.find(params[:id])
---
SELECT "url_shorteners".* FROM "url_shorteners" WHERE "url_shorteners"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def init_url_shortener
    return if params[:url_shortener] == 'admin'

    @url_shortener = UrlShortener.find_by_shortened_url(params[:url_shortener])
---
SELECT "url_shorteners".* FROM "url_shorteners" WHERE "url_shorteners"."shortened_url" = $1 LIMIT $2  [["shortened_url", "b6e75a"], ["LIMIT", 1]]